<template>
    <div class="reg">
        <div class="reg_img" @click="retu">
            <img src="../../assets/ret.png" />
        </div>
        <h3 class="h3_hed">
           欢迎您使用“叮咚买菜”App，在您使用“叮咚买菜”App前，您须仔细阅读、理解《叮咚买菜服务协议》（以下简称“本协议”）内容。一经您选择接受该协议或使用“叮咚买菜”App，即视为您已经阅读、理解协议内容，并同意与上海壹佰米网络科技有限公司（以下简称“壹佰米”）就您使用壹佰米向您提供的“叮咚买菜”App服务缔结合约。您在使用App过程中，应严格遵守本协议相应约定。如您没有阅读、理解并接受本协议所有条款，请您不要继续使用叮咚买菜提供的服务，您使用“叮咚买菜”App提供的服务，即视为您已阅读、理解并同意本协议的约束。

           如果您未满18周岁，请在法定监护人的陪同下阅读本协议。
        </h3> 
        <div>
            <h4>一、协议的订立</h4>
            <h5>1.1 本协议，指本协议正文、叮咚买菜的平台规则、其修订版本等所列明的所有规则性文件、通知或其他公示内容。上述内容一经正式发布，即为本协议不可分割的组成部分。如您不接受本协议的全部或部分条款，请您不要使用、登录“叮咚买菜”，或立即予以卸载。

            1.2 本协议各条的标题仅为方便阅读而设，不影响本协议的含义或解释。
            </h5>
            <h4>二、协议的生效与变更</h4>
            <h5>
            2.1 叮咚买菜有权在必要时修改本协议条款并及时更新公示，经修订的协议一经在“叮咚买菜”App公布后，立即自动生效。您可以在“叮咚买菜”App中随时查阅最新版本的协议条款。

            2.2 本协议条款变更后，如果您继续使用叮咚买菜提供的服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应停止使用“叮咚买菜”App。
            </h5>
            <h4>三、定义和解释</h4>
            <h5>
            3.1 叮咚买菜：指由壹佰米提供技术支持和服务，并负责运营的生活服务类手机应用App。随着叮咚买菜服务范围或服务项目的变更，叮咚买菜可能在平台规则或公告中对叮咚买菜的相关调整予以声明。

            3.2 平台规则：指在叮咚买菜上已经发布或将来可能发布的各种规范性文件，包括但不限于细则、规范、政策、通知、公告等规范性文件，所有规范性文件为协议不可分割的一部分，与协议正文具有同等法律效力。

            3.3 平台服务：指壹佰米依托叮咚买菜App向用户提供的网络空间、技术支持、相关的软件服务、系统维护，以及同意向用户提供的各项附属功能、增值服务等，具体服务内容及功能以“叮咚买菜”App显示功能为准。

            3.4 用户：指使用“叮咚买菜”App的自然人、法人或其他组织，本协议中又称“您”。

            3.5 商品：包括商品和服务。

            3.6 账号：指用户所拥有的经壹佰米认可，可以登录“叮咚买菜”App的一个合法获得并持有的服务账号。该账号形式可能是在叮咚买菜注册所获得的账号、手机号、电子邮箱等壹佰米支持的账号形式。

            3.7 互联网支付服务：指具有互联网支付合法资质的第三方支付机构为用户完成交易、转移资金提供的支付服务，详情见该第三方支付机构通过用户与其所签订的约定其所提供支付服务的协议、公司网站、电子邮件或其他形式所公布的相关规则及说明。

            3.8 关联公司：本协议所称一方的“关联公司”是指由一方直接控制或间接控制；或直接或间接控制一方；或与一方共同控制同一家公司或能对其施加重大影响；或与一方受同一家公司直接或间接控制的公司。包括但不限于一方的母公司、子公司；与一方受同一母公司控制的子公司；一方的合营企业、联营企业等。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被人民法院认定的方式。
            </h5>
            <h4>四、注册用户和账号</h4>
            <h5>
            4.1 用户使用“叮咚买菜”App应具备完全民事行为能力，若用户不具备前述资格，用户的监护人应承担一切后果，且壹佰米有权注销或永久冻结该用户账号，“叮咚买菜”有权就由此造成任何损失主张赔偿。

            4.2 用户使用“叮咚买菜”App，必须拥有经壹佰米认可的、可登录“叮咚买菜”App的、一个合法获得并持有的服务账号；用户对前述账号的申请、使用等行为应符合本协议及注册该账号时与相应的第三方账号服务提供者所签订的注册协议、服务协议以及其他有关规则。用户应自行确保上述账号及其密码的安全，并对利用上述账号及其密码所进行的一切行为负完全责任。

            4.3 用户名的设置和使用不得违反国家法律法规、公序良俗，否则壹佰米可注销您的账号。

            4.4 原则上您只能注册一个账号，严禁注册多个账号若有违反，“叮咚买菜”有权取消交易并停止向该用户提供服务，用户因此获取的利益须退还。虽有多个注册账号但经平台判断，存在相同注册电话号码、收货电话号码、支付账号、应用设备、2人次以上收货地址等情况的，将视为同一用户，平台将不会发放相关优惠福利等，如已发放，平台有权做无效处理。

            4.5 您理解并同意，若您的行为违反有关法律、本协议相关规定或滥用用户权利的，您的用户资格和账号可能被注销、暂时冻结或永久冻结；使壹佰米遭受任何损失、受到任何第三方的索赔、或任何行政管理部门的处罚的，用户应对壹佰米提供补偿，包括合理的维权费用。

            4.6 您理解并同意，您下载叮咚买菜APP不视为叮咚买菜必须按照您的要求出售商品，叮咚买菜有权按照商品库存状况及本协议约定等因素评估是否接受您的购买要约。

            4.7 您理解并同意，叮咚买菜有权基于运营情况设定或调整软件界面、功能等，如您在使用过程中需要操作指引，可通过客服服务获取帮助。

            4.8 您理解并同意，叮咚买菜有权基于您已有的消费评价、投诉等实际行为判断您是否不认可本协议约定内容、平台公示规则等展现的叮咚买菜的服务内容和方式，如确认属实，叮咚买菜有权选择提示您或终止对您提供服务。
            </h5>
            <h4>五、用户信息收集、使用和保护</h4>
            <h5>
            5.1 用户在使用“叮咚买菜”App时需要根据要求披露一些信息，包括但不限于您选择接受服务的社区地址、联系电话、收货地址等，及根据第三方支付机构的要求为享受互联网支付服务而需要提供的一些必要信息，这些信息包括但不限于：真实姓名或名称、联系地址、邮箱和联系电话等。您应保证这些信息在提供时是真实、准确、有效且完整的，且应及时根据实际情况或者叮咚买菜的要求更新这些信息。由于信息披露不完整、不真实或者信息更新不及时导致您在享受平台服务时受到限制或损失的，应由您独立承担责任。除了必要信息外，您也有权自行决定披露一些其他信息。

            5.2 您授权“叮咚买菜”App收集您的用户信息，这些信息可能包括注册信息或企业主体资质信息、产品信息和交易信息以及您的地理位置等，“叮咚买菜”App对用户信息的收集将遵循相关法律的规定。您同时授权“叮咚买菜”App和壹佰米全国通用（在法律许可范围内）的、免费的许可使用权利（并有权对该权利再授权），使“叮咚买菜”App和壹佰米有权（全部或部分地）使用、复制、修订、改写、发布、翻译、发布、执行和展示您所公示于叮咚买菜的各类信息（不包括您的个人身份信息）或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述您所公示的各类信息纳入其他作品内。

            5.3 壹佰米将采取适当措施，根据相关法律的要求，对用户信息提供充分的信息安全保障。用户应妥善保管、使用其用户信息，包括账号号码及其验证码、与交易有关的支付账号及密码、联系方式、地址等信息，因上述信息泄露而导致您的任何损失，包括使用叮咚买菜上的任何第三方应用软件造成信息泄露而导致您的任何损失，由您独立承担责任。如您泄露上述任何信息，您还应及时将泄露的情况以有效方式立即通知叮咚买菜，以便叮咚买菜在合理时间内采取措施防止损失继续扩大，但叮咚买菜对采取措施前已经产生的后果不承担任何责任。

            5.4 壹佰米保证不对外公开或向任何第三方提供您的个人信息，但是存在下列情形之一的除外：

            5.4.1 公开或提供相关信息之前获得您许可的；
            5.4.2 根据法律或政策的规定而公开或提供的；
            5.4.3 只有公开或提供您的个人信息，才能提供您所需的商品的；
            5.4.4 只有公开或提供您的个人信息，才能提供您需要的叮咚买菜服务的；
            5.4.5 根据国家权力机关要求公开或提供的；
            5.4.6 根据本协议其他条款约定而公开或提供的。
            5.5 为了向您提供更优质的叮咚买菜服务，提升购物体验，您同意叮咚买菜可将您的个人信息提供给叮咚买菜的关联公司。

            5.6 您理解并认同，在平台方发生并购等情况时，平台方可能会向第三方出售或转让叮咚买菜。在该等交易中，作为叮咚买菜不可分割的一部分，您的用户信息也可能将被转让给该第三方，以使该第三方可以继续为您提供服务。
            </h5>
        </div>
    </div>
</template>
<script>
export default {
    data(){
        return{}
    },
    methods:{
        retu(){
            history.go(-1);
        }
    }
}
</script>
<style scoped>
    .reg{
        width:100%;
        height:100%;
    }
    .h3_hed{
        margin-top: 66px;
    }
    .reg_img{
        width:100%;
        height: 50px;
        background: gray;
        margin:7px 0 10px 11px;
        position: fixed;;
        top:-7px;
        left:-11px;
        align-items:center;
    }
    .reg_img>img{
        margin-top: 8px;
        margin-left: 10px;
    }
</style>
